import React, { useEffect,useState } from 'react'
import Rate from '../../common/Rate/Rate'
const LeftDiv = ({New}) => {
  const [text, setText] = useState("ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است. ری اکت (React) یک کتابخانه جاوا اسکریپتی برای ساخت رابط کاربری بوده که برای ایجاد برنامه‌های تحت وب با استفاده از کامپوننت‌ها، قابل استفاده است.");
  const [firstPart, setFirstPart] = useState('');
  const [secondPart, setSecondPart] = useState('');

  useEffect(() => {
    textCalc();
  },[])

  function textCalc(){
    if (text.length > 0) {

      const firstPartLength = Math.ceil(text.length / 3);

      const lastIndexOfDot = text.lastIndexOf('.', firstPartLength);

      const splitIndex = lastIndexOfDot !== -1 ? lastIndexOfDot + 1 : firstPartLength;

      setFirstPart(text.slice(0, splitIndex).trim()); 
      setSecondPart(text.slice(splitIndex).trim()); 
    }
  }
  return (
    <div className='w-[50%] flex gap-10 flex-col'>
        <img className='w-[100%] h-[460px] bg-[#4DBFFF] rounded-[24px]' />
        <div className='text-[#272727] font-[700] text-[20px] text-right leading-[30px]' style={{direction:"rtl"}}>
          <p className='text-justify'>{firstPart}</p>
          <br/>
          <p className='text-justify'>{secondPart}</p>
        </div>
        <Rate/>
        <div className='font-[700] text-[50px] text-[#272727] text-right'>نظرات</div>

        {/* Put Comment <Comment/> */}
    </div>
  )
}

export default LeftDiv